Router#show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0/0   unassigned      YES NVRAM  up                    down 
GigabitEthernet0/0/1   192.168.1.1     YES manual up                    up 
GigabitEthernet0/0/2   unassigned      YES NVRAM  administratively down down 
Vlan1                  unassigned      YES NVRAM  administratively down down
Router#
%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up

Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#access-list 1 deny 192.168.1.2
Router(config)#access-list 1 permit any
Router(config)#interface GigabitEthernet0/0/1
Router(config-if)#ip access-group 1 in 
Router(config-if)#exit
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#write
Building configuration...
[OK]
Router#show access-lists
Standard IP access list 1
    10 deny host 192.168.1.2
    20 permit any

Router#show running-config | include access-list
access-list 1 deny host 192.168.1.2
access-list 1 permit any
Router#